src/CF/Catalogs/Пользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Catalog>
		<Properties>
			<Name>Пользователи</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Доступ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодПрава</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектДоступа</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УровеньДоступа</Name>
							<Type>
								<v8:Type>cfg:EnumRef.УровниДоступа</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УсловиеДоступа</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1020</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОСтроке</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПринудительныйОтборДанных</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОтборИспользуется</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбластьОтбора</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РеквизитОбъекта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УсловиеОтбора</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеУсловия</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
								<v8:TypeSet>cfg:EnumRef</v8:TypeSet>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>1020</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УсловиеДляОтбора</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяОбластиОтбора</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОСтроке</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CF/Catalogs/Пользователи/Ext/ManagerModule.bsl
// sza160210-1615

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
Процедура НаПечать(ДокументДляПечати, Ссылка) Экспорт

	Макет = Справочники.Пользователи.ПолучитьМакет("НаПечать");

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Пользователи.ДатаРегистрации,
	|	Пользователи.ДополнительнаяОбработка,
	|	Пользователи.ЗапускатьМодально,
	|	Пользователи.Код,
	|	ВЫРАЗИТЬ(Пользователи.Комментарий КАК СТРОКА(1000)) КАК Комментарий,
	|	Пользователи.Наименование,
	|	Пользователи.НеПозволятьЗакрыть,
	|	Пользователи.Подпись,
	|	Пользователи.ПриЗапускеОткрывать,
	|	Пользователи.ПрограммаКлиентНаСтарте,
	|	Пользователи.ПрограммаКлиентПриОкончании,
	|	Пользователи.ПрограммаСерверНаСтарте,
	|	Пользователи.ПрограммаСерверПриОкончании,
	|	Пользователи.Сотрудник,
	|	Пользователи.Доступ.(
	|		НомерСтроки,
	|		КодПрава,
	|		ОбъектДоступа,
	|		УровеньДоступа,
	|		УсловиеДоступа,
	|		ОСтроке
	|	),
	|	Пользователи.ПринудительныйОтборДанных.(
	|		НомерСтроки,
	|		ГруппаИли,
	|		ОтборИспользуется,
	|		ОбластьОтбора,
	|		РеквизитОбъекта,
	|		УсловиеОтбора,
	|		ЗначениеУсловия,
	|		УсловиеДляОтбора,
	|		ИмяОбластиОтбора,
	|		ОСтроке
	|	),
	|	Пользователи.СкрытьНастройкиОтчетов.(
	|		НомерСтроки,
	|		НаименованиеОтчета,
	|		СкрытьНастройки,
	|		ОСтроке
	|	)
	|ИЗ Справочник.Пользователи КАК Пользователи
	|ГДЕ Пользователи.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);

	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьДоступШапка = Макет.ПолучитьОбласть("ДоступШапка");
	ОбластьДоступ = Макет.ПолучитьОбласть("Доступ");
	ОбластьПринудительныйОтборДанныхШапка = Макет.ПолучитьОбласть("ПринудительныйОтборДанныхШапка");
	ОбластьПринудительныйОтборДанных = Макет.ПолучитьОбласть("ПринудительныйОтборДанных");
	ОбластьСкрытьНастройкиОтчетовШапка = Макет.ПолучитьОбласть("СкрытьНастройкиОтчетовШапка");
	ОбластьСкрытьНастройкиОтчетов = Макет.ПолучитьОбласть("СкрытьНастройкиОтчетов");
	ДокументДляПечати.Очистить();
	ВставлятьРазделительСтраниц = Ложь;

	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ДокументДляПечати.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ОбщийМодульСервисСервер.ЗаменитьСвоиЗначенияПараметровПечати(ОбластьЗаголовок);
		ДокументДляПечати.Вывести(ОбластьЗаголовок);
		Шапка.Параметры.Заполнить(Выборка);
		ОбщийМодульСервисСервер.ЗаменитьСвоиЗначенияПараметровПечати(Шапка);
		ДокументДляПечати.Вывести(Шапка, Выборка.Уровень());
		ОбщийМодульСервисСервер.ЗаменитьСвоиЗначенияПараметровПечати(ОбластьДоступШапка);
		ДокументДляПечати.Вывести(ОбластьДоступШапка);
		ВыборкаДоступ = Выборка.Доступ.Выбрать();

		Пока ВыборкаДоступ.Следующий() Цикл
			ОбластьДоступ.Параметры.Заполнить(ВыборкаДоступ);
			ОбщийМодульСервисСервер.ЗаменитьСвоиЗначенияПараметровПечати(ОбластьДоступ);
			ДокументДляПечати.Вывести(ОбластьДоступ, ВыборкаДоступ.Уровень());

		КонецЦикла;

		ОбщийМодульСервисСервер.ЗаменитьСвоиЗначенияПараметровПечати(ОбластьПринудительныйОтборДанныхШапка);
		ДокументДляПечати.Вывести(ОбластьПринудительныйОтборДанныхШапка);
		ВыборкаПринудительныйОтборДанных = Выборка.ПринудительныйОтборДанных.Выбрать();
		Пока ВыборкаПринудительныйОтборДанных.Следующий() Цикл
			ОбластьПринудительныйОтборДанных.Параметры.Заполнить(ВыборкаПринудительныйОтборДанных);
			ОбщийМодульСервисСервер.ЗаменитьСвоиЗначенияПараметровПечати(ОбластьПринудительныйОтборДанных);
			ДокументДляПечати.Вывести(ОбластьПринудительныйОтборДанных, ВыборкаПринудительныйОтборДанных.Уровень());

		КонецЦикла;

		ОбщийМодульСервисСервер.ЗаменитьСвоиЗначенияПараметровПечати(ОбластьСкрытьНастройкиОтчетовШапка);
		ДокументДляПечати.Вывести(ОбластьСкрытьНастройкиОтчетовШапка);
		ВыборкаСкрытьНастройкиОтчетов = Выборка.СкрытьНастройкиОтчетов.Выбрать();
		Пока ВыборкаСкрытьНастройкиОтчетов.Следующий() Цикл
			ОбластьСкрытьНастройкиОтчетов.Параметры.Заполнить(ВыборкаСкрытьНастройкиОтчетов);
			ОбщийМодульСервисСервер.ЗаменитьСвоиЗначенияПараметровПечати(ОбластьСкрытьНастройкиОтчетов);
			ДокументДляПечати.Вывести(ОбластьСкрытьНастройкиОтчетов, ВыборкаСкрытьНастройкиОтчетов.Уровень());

		КонецЦикла;

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;

КонецПроцедуры

#КонецЕсли
